ut/src/InformationRegisters/АУ_ПросмотренныеЗадачиИсполнителей/АУ_ПросмотренныеЗадачиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_ПросмотренныеЗадачиИсполнителей</name>
  <resources>
    <name>ДатаПервогоОткрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗадачаИсполнителя</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ut/src/CommonModules/АУ_Привелигированный/Module.bsl
Процедура ИзменитьСтатьиБюджетаВДокументе(Документ,СтатьиБюджета,ДатаБюджета,ФактическийКурсВалюты) Экспорт
	
	Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("50e1e88f-c391-4c75-abe3-1ed5c94f29cc");
	УдалятьРегистрацию = НЕ ПланыОбмена.ИзменениеЗарегистрировано(Узел, Документ);
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина);
	ТекОбъект = Документ.ПолучитьОбъект();
	ТекОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	
	ТекОбъект.АУ_ДатаБюджета = ДатаБюджета;
	ТекОбъект.АУ_ФактическийКурсВалюты = ФактическийКурсВалюты;
	ТекОбъект.АУ_СтатьиБюджета.Загрузить(СтатьиБюджета);
	
	ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Если УдалятьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Документ);
	КонецЕсли;
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Ложь);
	
КонецПроцедуры

Процедура ИзменитьДатуОплатыЗРДС(Документ, НоваяДатаОплаты) Экспорт
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина);
	ТекОбъект = Документ.ПолучитьОбъект();
	ТекОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	
	ТекОбъект.ДатаПлатежа = НоваяДатаОплаты;
	ТекОбъект.ЖелательнаяДатаПлатежа = НоваяДатаОплаты;
	
	Для каждого стрСчет Из ТекОбъект.РаспределениеПоСчетам Цикл
		стрСчет.ДатаПлатежа = НоваяДатаОплаты;
	КонецЦикла;
	
	ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Ложь);
	
КонецПроцедуры

Функция ПолучитьПараметрыПретензииДляОтправкиПисьмаПоПриложенномуФайлу(Файл) Экспорт
	
	Претензия=Файл.ВладелецФайла;
	Получатели = Новый СписокЗначений;
	
	Текст = "Добрый день!
			|
            |%1
            |
            |
            |
            |
			|С уважением,                
			|ООО «АУРУМ»
			|Россия, 115184, г. Москва,
			|Улица Большая Татарская, 9,
			|тел.: +7 (499) 270-27-30
			|https://www.aurummedical.com/";
	
	Если ЗначениеЗаполнено(Претензия) Тогда
		
		Если Претензия.ЭтоПретензияПоставщику Тогда
			Тело=СтрШаблон("Направляем вам письмо №%1 от %2",Претензия.Наименование,Формат(Претензия.АУ_ДатаПретензии,"ДЛФ=Д"));
			Тема = СтрШаблон("%1. %2 от %3",Претензия.Договор, Претензия.Наименование, Формат(Претензия.АУ_ДатаПретензии,"ДЛФ=Д"));
		Иначе
			Тело=СтрШаблон("Направляем вам ответ на ваше письмо №%1 от %2 (во вложении).",Претензия.Наименование,Формат(Претензия.АУ_ДатаПретензии,"ДЛФ=Д"));
			Тема = СтрШаблон("%1. Ответ на %2 от %3",Претензия.Договор, Претензия.Наименование, Формат(Претензия.АУ_ДатаПретензии,"ДЛФ=Д"));
		КонецЕсли;
		
		Текст=СтрШаблон(Текст,Тело);
		
		Почта = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьEmailКонтрагента(Претензия.Контрагент);
		Если ЗначениеЗаполнено(Почта) Тогда
			Получатели.Добавить(Почта);
		КонецЕсли;
		
		Для каждого стрКонтакт Из Претензия.ПартнерыИКонтактныеЛица Цикл
			
			Если ЗначениеЗаполнено(стрКонтакт.КонтактноеЛицо) Тогда
				Почта = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьEmailОбъекта(стрКонтакт.КонтактноеЛицо);
			ИначеЕсли ЗначениеЗаполнено(стрКонтакт.Партнер) Тогда
				Почта = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьEmailОбъекта(стрКонтакт.Партнер);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Почта) Тогда
				Получатели.Добавить(АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьEmailОбъекта(стрКонтакт.Партнер));
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Текст=СтрШаблон(Текст,"");
		Тема="";
		
	КонецЕсли;
	
	Возврат Новый Структура("Тема,Текст,Получатель", Тема, Текст, Получатели);
	
КонецФункции

Процедура ИзменитьРеквизитДокумента(Документ, ИмяРеквизита, Значение) Экспорт
	
	Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("50e1e88f-c391-4c75-abe3-1ed5c94f29cc");
	УдалятьРегистрацию = НЕ ПланыОбмена.ИзменениеЗарегистрировано(Узел, Документ);
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина);
	ТекОбъект = Документ.ПолучитьОбъект();
	ТекОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	
	ТекОбъект[ИмяРеквизита] = Значение;
	
	ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если УдалятьРегистрацию Тогда
		Попытка
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Документ);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Ложь);
	
КонецПроцедуры


Процедура АУ_ПередЗаписьюРНВыручкаИСебестоимостьПродажПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Регистратор = Источник.Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры
		|ПОМЕСТИТЬ ВТРегистр
		|ИЗ
		|	&ТЗ КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.АУ_Шифр КАК АУ_Шифр,
		|	ВТРегистр.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТРегистр КАК ВТРегистр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТРегистр.АналитикаУчетаНоменклатуры.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТРегистр.АналитикаУчетаНоменклатуры.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|			И ВТРегистр.АналитикаУчетаНоменклатуры.Серия = РеализацияТоваровУслугТовары.Серия
		|ГДЕ
		|	НЕ РеализацияТоваровУслугТовары.АУ_Шифр = """"
		|	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ТЗ", Источник.Выгрузить(, "НомерСтроки, АналитикаУчетаНоменклатуры"));
		Запрос.УстановитьПараметр("Ссылка", Регистратор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.АУ_Шифр) Тогда
				Источник[Выборка.НомерСтроки - 1].АУ_Шифр = Выборка.АУ_Шифр;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Возвращает невыполненные задачи текущего пользователя, которые еще не открывались исполнителем.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Ссылка - ЗадачаСсылка.ЗадачаИсполнителя
//   * Наименование - Строка
//   * Описание - Строка
//   * НавигационнаяСсылка - Строка
//
Функция НовыеЗадачиИсполнителяДляОповещений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	|	ЗадачаИсполнителя.Наименование КАК Наименование,
	|	ЗадачаИсполнителя.Описание КАК Описание
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|		ПО ЗадачаИсполнителя.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
	|			И ЗадачаИсполнителя.ОсновнойОбъектАдресации = ИсполнителиЗадач.ОсновнойОбъектАдресации
	|			И ЗадачаИсполнителя.ДополнительныйОбъектАдресации = ИсполнителиЗадач.ДополнительныйОбъектАдресации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АУ_ПросмотренныеЗадачиИсполнителей КАК ПросмотренныеЗадачи
	|		ПО (ПросмотренныеЗадачи.ЗадачаИсполнителя = ЗадачаИсполнителя.Ссылка)
	|			И (ПросмотренныеЗадачи.Пользователь = &ТекущийПользователь)
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|	И (ЗадачаИсполнителя.Исполнитель = &ТекущийПользователь
	|		ИЛИ ИсполнителиЗадач.Исполнитель = &ТекущийПользователь)
	|	И ПросмотренныеЗадачи.ЗадачаИсполнителя ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Задача = Новый Структура;
		Задача.Вставить("Ссылка", Выборка.Ссылка);
		Задача.Вставить("Наименование", Выборка.Наименование);
		Задача.Вставить("Описание", Выборка.Описание);
		Задача.Вставить("НавигационнаяСсылка", ПолучитьНавигационнуюСсылку(Выборка.Ссылка));
		
		Результат.Добавить(Задача);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает период опроса новых задач для оповещений в секундах.
// Если настройка ПериодОпросаНовыхЗадачДляОповещения не задана или равна 0, возвращает 60.
//
// Возвращаемое значение:
//  Число
//
Функция ПериодОпросаНовыхЗадачДляОповещения() Экспорт
	
	ПериодОпроса = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки(
		"ПериодОпросаНовыхЗадачДляОповещения");
	
	Если НЕ ЗначениеЗаполнено(ПериодОпроса) Тогда
		Возврат 60;
	КонецЕсли;
	
	Возврат ПериодОпроса;
	
КонецФункции

// Фиксирует первое открытие задачи текущим пользователем.
// Повторные открытия не изменяют дату первого открытия.
//
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.ЗадачаИсполнителя
//
Процедура ЗафиксироватьПросмотрЗадачиИсполнителя(ЗадачаСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	НаборЗаписей = РегистрыСведений.АУ_ПросмотренныеЗадачиИсполнителей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);
	НаборЗаписей.Отбор.ЗадачаИсполнителя.Установить(ЗадачаСсылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = ТекущийПользователь;
	НоваяЗапись.ЗадачаИсполнителя = ЗадачаСсылка;
	НоваяЗапись.ДатаПервогоОткрытия = ТекущаяДатаСеанса();
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
